duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/imu/lsm6dso.c
		if(is_tilt())
		{
		#ifdef IMU_DEBUG
			LOGD("tilt trigger!");
		#endif
			if(lcd_is_sleeping && global_settings.wake_screen_by_wrist)
			{
				sleep_out_by_wrist = true;
				lcd_sleep_out = true;
			}
		}
	}

#ifdef CONFIG_FALL_DETECT_SUPPORT
	if(int2_event && global_settings.fall_check) //fall
	{
	#ifdef IMU_DEBUG
		LOGD("int2 evt!");
	#endif

		if(!imu_check_ok || !is_wearing() || fall_result)
			return;
		
		if(is_tap())
		{
		#if CONFIG_PRESSURE_SUPPORT
			pre_last = pre_1;
		#endif

		#if 0 //Tap detection
			k_timer_start(&tap_detect_timer, K_SECONDS(3), K_NO_WAIT);

			if(k_timer_remaining_get(&tap_detect_timer)>=0)
			{
				tap_detection();
			}
		#else
			//k_work_schedule_for_queue(imu_work_q, &fall_work, K_NO_WAIT);
			fall_detection();
		#endif
		}

		int2_event = false;
	}

	if(RUN_FD_FLAG)
	{
		RUN_FD_FLAG = false;
		
		//k_work_schedule_for_queue(imu_work_q, &fall_work, K_NO_WAIT);
		fall_detection();
	}

	if(fall_result)
	{
		fall_result = false;

	#if 0 // Activity detection
		k_timer_start(&imu_activity_timer, K_SECONDS(3), K_NO_WAIT);

		while(1)
		{
			lsm6dso_all_sources_t status3;

			lsm6dso_all_sources_get(&imu_dev_ctx, &status3);
			if(status3.wake_up_src.wu_ia)
			{
				activity_num++;
				//LOGD("Acitvity detected: %d", activity_num);
			}

			if(k_timer_remaining_get(&imu_activity_timer) == 0)
			{
				break;
			}
		}
	#else
	  #if 1 // SCC detections
		StartSCC();
		k_timer_start(&fall_scc_timer, K_SECONDS(9), K_NO_WAIT);
	  #else
	   #ifdef CONFIG_PRESSURE_SUPPORT
		//.....
	   #else
		FallTrigger();
	   #endif
	  #endif
	#endif
	}
	
	if(SCC_check_ok)
	{
		SCC_check_ok = false;

		//tilt_enable();

	#ifdef CONFIG_PRESSURE_SUPPORT
		fall_prs = pre_1;
		if((fall_prs - pre_last) >= 5) // 1m = +-11pa
		{
			FallTrigger();
		}
	#else
		FallTrigger();
	#endif
	}
	
	if(fall_check_flag)
	{
		k_sleep(K_MSEC(3));
	}
#endif
}
#endif/*CONFIG_IMU_SUPPORT*/
